; domain
(define (domain p2)
(:requirements :strips :typing)

(:types 
    location 
    crate 
    content
    person
    drone
    carrier
    carrier_space
    num
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (carrier-at ?carrier - carrier ?location - location)
    (empty-space ?carrier - carrier ?space - carrier_space)
    (next ?numA - num ?numB - num) 
    (crate-at-space ?crate - crate ?carrier - carrier ?space - carrier_space) 
)

(:action put-crate-in-carrier
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?carrier_space - carrier_space
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)
        (carrier-at ?carrier ?location) 
        (empty-space ?carrier ?carrier_space)           
    )
    :effect (and
        (not (empty-space ?carrier ?carrier_space))
        (crate-at-space ?crate ?carrier ?carrier_space)        
        (not (crate-at ?crate ?location))    
    )
)

(:action move-carrier
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
        ?carrier - carrier
    )
    :precondition (and 
        (drone-at ?drone ?location_from)
        (carrier-at ?carrier ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from))
        (drone-at ?drone ?location_to)
        (not (carrier-at ?carrier ?location_from))
        (carrier-at ?carrier ?location_to)     
    )
)

(:action pick-and-drop
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?carrier_space - carrier_space
        ?person - person
        ?content - content 
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (carrier-at ?carrier ?location)
        (crate-at-space ?crate ?carrier ?carrier_space)
        (person-at ?person ?location)           
        (content-crate ?content ?crate) 
    )
    :effect (and
        (empty-space ?carrier ?carrier_space)
        (not (crate-at-space ?crate ?carrier ?carrier_space))        
        (has-content-person ?person ?content)   
    )
)
)

; problem
(define (problem drone_problem_d1_r1_l11_p11_c11_g11_ct2)
(:domain p2)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	carrier1 - carrier
	space1 - carrier_space
	space2 - carrier_space
	space3 - carrier_space
	space4 - carrier_space
	N0 - num
	N1 - num
	N2 - num
	N3 - num
	N4 - num
	N5 - num
	N6 - num
	N7 - num
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 depot)
	(crate-at crate2 depot)
	(crate-at crate3 depot)
	(crate-at crate4 depot)
	(crate-at crate5 depot)
	(crate-at crate6 depot)
	(crate-at crate7 depot)
	(crate-at crate8 depot)
	(crate-at crate9 depot)
	(crate-at crate10 depot)
	(crate-at crate11 depot)
	(carrier-at carrier1 depot)
	(empty-space carrier1 space1)
	(empty-space carrier1 space2)
	(empty-space carrier1 space3)
	(empty-space carrier1 space4)
	(content-crate food crate1)
	(content-crate medicine crate2)
	(content-crate medicine crate3)
	(content-crate medicine crate4)
	(content-crate medicine crate5)
	(content-crate medicine crate6)
	(content-crate medicine crate7)
	(content-crate medicine crate8)
	(content-crate medicine crate9)
	(content-crate medicine crate10)
	(content-crate medicine crate11)
	(person-at person1 loc8)
	(person-at person2 loc5)
	(person-at person3 loc4)
	(person-at person4 loc3)
	(person-at person5 loc2)
	(person-at person6 loc2)
	(person-at person7 loc6)
	(person-at person8 loc3)
	(person-at person9 loc11)
	(person-at person10 loc2)
	(person-at person11 loc10)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person1 medicine)
	(has-content-person person2 food)
	(has-content-person person2 medicine)
	(has-content-person person4 medicine)
	(has-content-person person5 medicine)
	(has-content-person person6 medicine)
	(has-content-person person7 medicine)
	(has-content-person person8 medicine)
	(has-content-person person9 medicine)
	(has-content-person person10 medicine)
	(has-content-person person11 medicine)
))
)

; plan
1. (put-crate-in-carrier crate11 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate11 depot)
   added: (crate-at-space crate11 carrier1 space4)
   goals met: 1 of 12
2. (put-crate-in-carrier crate1 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate1 depot)
   added: (crate-at-space crate1 carrier1 space3)
   goals met: 1 of 12
3. (move-carrier depot loc5 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc5) (carrier-at carrier1 loc5)
   goals met: 0 of 12
4. (pick-and-drop crate1 loc5 drone1 carrier1 space3 person2 food)
   deleted: (crate-at-space crate1 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person2 food)
   goals met: 1 of 12
5. (pick-and-drop crate11 loc5 drone1 carrier1 space4 person2 medicine)
   deleted: (crate-at-space crate11 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person2 medicine)
   goals met: 2 of 12
6. (move-carrier loc5 depot drone1 carrier1)
   deleted: (drone-at drone1 loc5) (carrier-at carrier1 loc5)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 3 of 12
7. (put-crate-in-carrier crate10 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate10 depot)
   added: (crate-at-space crate10 carrier1 space4)
   goals met: 3 of 12
8. (move-carrier depot loc11 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc11) (carrier-at carrier1 loc11)
   goals met: 2 of 12
9. (pick-and-drop crate10 loc11 drone1 carrier1 space4 person9 medicine)
   deleted: (crate-at-space crate10 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person9 medicine)
   goals met: 3 of 12
10. (move-carrier loc11 depot drone1 carrier1)
   deleted: (drone-at drone1 loc11) (carrier-at carrier1 loc11)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 4 of 12
11. (put-crate-in-carrier crate9 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate9 depot)
   added: (crate-at-space crate9 carrier1 space4)
   goals met: 4 of 12
12. (move-carrier depot loc10 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc10) (carrier-at carrier1 loc10)
   goals met: 3 of 12
13. (pick-and-drop crate9 loc10 drone1 carrier1 space4 person11 medicine)
   deleted: (crate-at-space crate9 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person11 medicine)
   goals met: 4 of 12
14. (move-carrier loc10 depot drone1 carrier1)
   deleted: (drone-at drone1 loc10) (carrier-at carrier1 loc10)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 5 of 12
15. (put-crate-in-carrier crate8 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate8 depot)
   added: (crate-at-space crate8 carrier1 space4)
   goals met: 5 of 12
16. (move-carrier depot loc8 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc8) (carrier-at carrier1 loc8)
   goals met: 4 of 12
17. (pick-and-drop crate8 loc8 drone1 carrier1 space4 person1 medicine)
   deleted: (crate-at-space crate8 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person1 medicine)
   goals met: 5 of 12
18. (move-carrier loc8 depot drone1 carrier1)
   deleted: (drone-at drone1 loc8) (carrier-at carrier1 loc8)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 6 of 12
19. (put-crate-in-carrier crate7 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate7 depot)
   added: (crate-at-space crate7 carrier1 space4)
   goals met: 6 of 12
20. (move-carrier depot loc6 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc6) (carrier-at carrier1 loc6)
   goals met: 5 of 12
21. (pick-and-drop crate7 loc6 drone1 carrier1 space4 person7 medicine)
   deleted: (crate-at-space crate7 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person7 medicine)
   goals met: 6 of 12
22. (move-carrier loc6 depot drone1 carrier1)
   deleted: (drone-at drone1 loc6) (carrier-at carrier1 loc6)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 7 of 12
23. (put-crate-in-carrier crate6 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate6 depot)
   added: (crate-at-space crate6 carrier1 space4)
   goals met: 7 of 12
24. (put-crate-in-carrier crate5 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate5 depot)
   added: (crate-at-space crate5 carrier1 space3)
   goals met: 7 of 12
25. (move-carrier depot loc3 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc3) (carrier-at carrier1 loc3)
   goals met: 6 of 12
26. (pick-and-drop crate5 loc3 drone1 carrier1 space3 person4 medicine)
   deleted: (crate-at-space crate5 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person4 medicine)
   goals met: 7 of 12
27. (pick-and-drop crate6 loc3 drone1 carrier1 space4 person8 medicine)
   deleted: (crate-at-space crate6 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person8 medicine)
   goals met: 8 of 12
28. (move-carrier loc3 depot drone1 carrier1)
   deleted: (drone-at drone1 loc3) (carrier-at carrier1 loc3)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 9 of 12
29. (put-crate-in-carrier crate4 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate4 depot)
   added: (crate-at-space crate4 carrier1 space4)
   goals met: 9 of 12
30. (put-crate-in-carrier crate3 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate3 depot)
   added: (crate-at-space crate3 carrier1 space3)
   goals met: 9 of 12
31. (move-carrier depot loc2 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc2) (carrier-at carrier1 loc2)
   goals met: 8 of 12
32. (pick-and-drop crate3 loc2 drone1 carrier1 space3 person5 medicine)
   deleted: (crate-at-space crate3 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person5 medicine)
   goals met: 9 of 12
33. (pick-and-drop crate4 loc2 drone1 carrier1 space4 person6 medicine)
   deleted: (crate-at-space crate4 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person6 medicine)
   goals met: 10 of 12
34. (move-carrier loc2 depot drone1 carrier1)
   deleted: (drone-at drone1 loc2) (carrier-at carrier1 loc2)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 11 of 12
35. (put-crate-in-carrier crate2 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate2 depot)
   added: (crate-at-space crate2 carrier1 space4)
   goals met: 11 of 12
36. (move-carrier depot loc2 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc2) (carrier-at carrier1 loc2)
   goals met: 10 of 12
37. (pick-and-drop crate2 loc2 drone1 carrier1 space4 person10 medicine)
   deleted: (crate-at-space crate2 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person10 medicine)
   goals met: 11 of 12
38. (move-carrier loc2 depot drone1 carrier1)
   deleted: (drone-at drone1 loc2) (carrier-at carrier1 loc2)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 12 of 12
